{
    "cover": {
        "header": "Leo goubard portfolio personnel",
        "job": "Developpeur Javascript",
        "firstAutoText": "Developpeur Javascript 1.7 années d'experience",
        "secondAutoText": "Pour mon amour du Cinéma et de la Literature"
    },
    "timeLine": [
        {
            "date": "Novembre 2022 - Present",
            "title": "Formation TypeScript, Projets",
            "content": "Apres mon experience chez Solotech, j'avais besoin de renforcer mes connaissances en TypeScript, ce pourquoi je me forme toujours aujourd'hui en plus de faire plusieurs projets que vous retrouverez sur ce site."
          },
          {
            "date": "Aout 2022 - Novembre 2022",
            "title": "Solotech - Montreal",
            "isLinked": true,
            "toGo": { "value1": 11, "value2": 12 },
            "content": "Mission Freelance - En full remote avec un client Canadien sur les stacks suivante: Vue/Node/Typesript/GraphQL/AWS",
            "image": "https://cdn.shopify.com/s/files/1/0614/9691/8254/files/SMALL-Solotech-symbol-4colors.png?v=1639492596"
          },
          {
            "date": "Janvier 2021 - Mai 2022",
            "title": "Joinery Business Solution - Nantes",
            "isLinked": true,
            "toGo": { "value1": 9, "value2": 10 },
            "content": "CDI - Application SaaS pour une société de Menuiserie sur les stacks suivante: React/Node/Express/Mongo/AWS.",
            "image": "https://zupimages.net/up/23/16/bgxd.png"
          },
          {
            "date": "Juillet 2020 - Decembre 2020",
            "title": "Projets / Recherche d'opportunité",
            "isLinked": true,
            "toGo": { "value1": 3, "value2": 4 },
            "content": "Suite à la formation O'Clock, j'ai crée plusieurs projets divers afin de renforcer mes competences développé lors des 6 derniers mois, avant d'etre recruté par ma premiere experience professionnelle."
          },
          {
            "date": "Janvier 2020 - Juillet 2020",
            "title": "O'Clock",
            "isLinked": true,
            "toGo": { "value1": 3, "value2": 4 },
            "content": "Formation de 6mois afin d'avoir un minimum de compétences dans le developpement Web et Web Mobile, à nous de transformer l'essai par la suite.",
            "image": "https://www.frenchtechbordeaux.com/wp-content/uploads/2021/11/Oclock.png"
          },
          {
            "date": "Fevrier 2019 - Decembre 2019",
            "title": "Intérim",
            "content": "Differents metiers abordé dans cette periode de transition professionnel en attendant la formation de Developpeur, d'autres cordes à mon arc afin de monter en compétences dans differents domaine et forger mes capacités professionnelle dans des metiers comme serveur, barman, btp etc."
          },
          {
            "date": "Fevrier 2018 - Fevrier 2019",
            "title": "WHV New Zealand",
            "content": "Grande aventure d'un an de voyage et de découvertes de nombreux differents métier, arrivé avec peu en poche je suis revenus en france avec un maitrise de l'anglais, un choix de carriere professionnel dessiné et une multitude d'aptitudes divers en milieu professionnel, barman, serveur, btp, livreur, peintre, vigneron, laveur, cuisinier.",
            "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3e/Flag_of_New_Zealand.svg/1280px-Flag_of_New_Zealand.svg.png"
          },
          {
            "date": "Septembre 2014 - Juillet 2017",
            "title": "Licence en Esthetique du cinema",
            "content": "Etudes de cinema à Metz qui me donnera la passion de l'annimation, de la realisation, de l'ecriture, et un certain esprit critique sur ce qui ce fait, un recul sur mes avis et une envie irrépréssible de realiser mes propres projets cinematographique !"
          },
          {
            "date": "Septembre 2010 - Juillet 2014",
            "title": "Bac ",
            "content": "Etudes d'architectures ce qui eveillera en moi l'envie de realiser des projets d'envergure, de comprendre que toutes accomplissements a besoin de fondations solide."
          }
    ],
    "projects": [
      {
        "image": "https://zupimages.net/up/23/16/ofax.png",
        "title": "Covid-Tracker",
        "stacks": "React - Chart.js - Leaflet - MaterialUI - Firebase",
        "description": "Petit projet en React, avec quelques librairies pour la map(Leaflet) et le graphique(Graph.js). l'application a été faite lors du début du Covid, les statistiques ont au fur et à mesure explosées qui fait qu'aujourd'hui les bulles indiquant la quantité par pays de cas sont enormes pas rapport la map. Cependant l'application reste fonctionelle.",
        "github": "https://github.com/LeoGoubard/Covid-19-Tracker",
        "web": "https://covid-19-tracker-9fcd1.web.app"
      },
      {
        "image": "https://zupimages.net/up/23/16/8u3j.png",
        "title": "Netflix-Clone",
        "stacks": "React - MAterialUI - Firebase",
        "description": "Simple projet d'integration HTML/CSS via du React avec l'utilisation de l'api 'movie-trailer' afin de recuperer les trailers de chaques films, et movieDB pour la liste de films. Le tout hébergé via Firebase.",
        "github": "https://github.com/LeoGoubard/netflix-clone",
        "web": "https://netflix-clone-87645.web.app/"
      },
      {
        "image": "https://zupimages.net/up/23/16/5kl9.png",
        "title": "Spotify-Clone",
        "stacks": "React - Firebase",
        "description": "Simple projet d'integration HTML/CSS via du React avec l'utilisation de l'api Spotify afin de recuperer les données concernant l'utilisateur connecté.",
        "github": "https://github.com/LeoGoubard/Spotify-Clone"
      },
      {
        "image": "https://zupimages.net/up/23/16/vnzl.png",
        "title": "Sharing-Moments",
        "stacks": "React - Node - Express - MongoDB - Redux - MaterialUI",
        "description": "Premier projet fullstack avec une stack MERN, connexion, partage de message, avec possibilité de commenté le message partage à tout les utilisateurs, egalement de liker les interactions, toutes ces données stockés sur un cluster MongoDB et par conscéquent creation d'un CRUD en back",
        "github": "https://github.com/LeoGoubard/SharingMoment-App-Mern"
      },
      {
        "image": "https://camo.githubusercontent.com/b61e5e14fa54284302665905b7548c96dc36a81c500fbda2172f0ce95ce8302a/68747470733a2f2f692e6962622e636f2f44564634744e572f696d6167652e706e67",
        "title": "Crypto-App",
        "web": "https://serene-genie-ed57b8.netlify.app",
        "stacks": "React - TailWind - Solidity - Chai",
        "description": "Légère application d'echange de cryptomonnaie via Metamask, avec la creation d'un smart_contract et intégration de quelques tests via Chai.",
        "github": "https://github.com/LeoGoubard/Solidity-ReactProject"
      },
      {
        "image": "https://camo.githubusercontent.com/651c6fe53413a6420174ed321877a8bddc3e1da1d21cfbc1233bb34f5f111f64/68747470733a2f2f7a7570696d616765732e6e65742f75702f32322f32362f31796e382e706e67",
        "title": "Chat-App",
        "web": "https://splendorous-treacle-5c22ab.netlify.app",
        "stacks": "React - Node - Twilio - Netlify",
        "description": "Projet de communication, creation de topics, categories en live",
        "github": "https://github.com/LeoGoubard/chat-webApp"
      }
    ],
    "oclock": {
      "title": "O'Clock",
      "date": "Janvier 2020/Juillet 2020",
      "description1": "Titre Professionnel Développeur Web et Web Mobile - Niveau III",
      "description2": "Développement web, Intégration, programmation, Javascript, HTML, React, Node, Express, API REST, MYSQL.",
      "description3": "6 mois de formation (840h), aussi labellisée « Grande École du Numérique ».",
      "learn": "Apprendre",
      "learnContent": "Découvrez toute la logique du développement informatique. Cette formation vous sert de tremplin grâce à l’apprentissage des technos web incontournables pour quiconque ambitionne une future carrière dans la tech.",
      "build": "Concevoir",
      "buildContent": "Au-delà de l’apprentissage des outils et langages web, la formation Socle vous permet d’aborder les problématiques de pilotage d’un projet : analyse du besoin, conception de cahier des charges, élaboration de récits utilisateurs, ou encore mise en place d’un cadre de travail agile.",
      "dev": "Developpement",
      "devContent": "On peut vouloir apprendre à faire du pain sans nécessairement désirer devenir boulanger. La formation a été pensée également pour celles et ceux qui veulent acquérir les compétences techniques nécessaires au développement de leur projet entrepreneurial."
    },
    "chapter": [
      {
      "title": "Chapitre 1 - Formation",
      "content1": "Apres mon PVT en Nouvelle-Zelande, j'ai décidé de me former dans un metier plus intelectuel où je pourrais mettre à bien mon energie à schematiser des applications/logiciels.",
      "content2": "Gagner en compétence dans un domaine qui me permettrait de mettre à plat mes idées, creer des projets web, des jeux, des services et autres outils utiles (ou non) au quotidien.",
      "content3": "Ce pourquoi j'entâme en 2020 mon année de Formation à temps plein pour devenir Developpeur Web."
      },
      {
        "title": "Chapitre 2 - Le Commencement",
        "content1": "Enfin apres 6 mois d'auto formation et projets divers je me fais repérer par une startup Nantaise, seul bémole c'est que nous ne sommes que 2 developpeurs en sortie de bootcamp.",
        "content2": "Challenge par la constitution de cette startup, nous avons un gros projet à produire, une motiviation debordante il s'agira donc de mettre à bien tous nos efforts dans un but commun sans compter nos heures.",
        "content3": "Mettre à bien nos compétences assidûment acquises et chercher constament à les améliorer en mettant un réel point d'interêt sur le recul de nos decisions et code."
      }
    ],
    "experience": [
      {
        "title": "Joinery Business Solution",
        "job": "Developpeur React/Node",
        "lieu": "Nantes, Pays de la Loire, France",
        "site": "https://www.iziqo.fr",
        "domain": "Construction(Menuiserie)",
        "team": [0, 1],
        "content": "Projet SaaS - une partie Menuiserie où la société Mnuiserie peut cataloguer ses produits et définir/configurer les problèmes métiers de chacune de leurs menuiseries. Une seconde partie Artisan où le Client/Artisan va pouvoir créer son Devis et recevoir sa menuiserie en chantier ou chez un particulier.",
        "creation": [
          "Participation/Animation cérémonies Agile",
          "Analyse des besoins techniques",
          "Propositions de choix techniques/Architecture",
          "Audit Technique et édition de documentation",
          "Chiffrage/Estimations des difficultés techniques de développements",
          "Relecture et contrôle de la qualité de code du second développeur",
          "Prise en charge de la passation de connaissances pour mon remplaçant",
          "Intégration HTML/CSS",
          "Debogage continue de l'application",
          "Développement de Modules côté Menuiserie pour les difficultés métiers de chaque typo de produit:",
          "Module de calcul de Surfaces",
          "Module de calcul de Contraintes",
          "Module de calcul de Limites dimensionnelles",
          "Module de calcul Descente de charges",
          "Module de calcul de Prix",
          "Module de Schéma 2D ( dessiné lors de la sélection du Client/Artisan afin de prévisualiser sa commande)"
        ],
        "project": [
          "Github",
          "Trello",
          "Slack"
        ],
        "javascript": [
          "Utilisation de Visual Studio Code",
          "Utilisation de NodeJS/ReactJS",
          "Génération d'XML via JSON enregistré dans un FTP pour la réception de la société Menuiserie et l'interprétation de leurs ERP"
        ],
        "aws": [
          "S3",
          "Route53",
          "Elastic Beanstalk",
          "EC2"
        ]
      },
      {
        "title": "Solotech",
        "job": "Developpeur Vue/Node",
        "lieu": "Montreal, Canada",
        "site": "https://www.solotech.com",
        "domain": "Multimedia",
        "team": [0, 1, 2, 3, 4, 5],
        "content": "Mission Freelance pour un Client canadien en Full Remote, le projet consistait à stabiliser une première version d'une plateforme de partage de flux pour des événements internationaux avec salles de réunion virtuelle, partage de documents, chat interne global et privé, gestion live de l'interface depuis la page admin avec egalement des statistiques concernant l'evenement.",
        "creation": [
          "Participation/Animation cérémonies Agile",
          "Analyse des besoins techniques",
          "Propositions de choix techniques/Architecture",
          "Audit Technique et édition de documentation",
          "Chiffrage/Estimations des difficultés techniques de développements",
          "Relecture et contrôle de la qualité de code de 5 développeurs",
          "Intégration HTML/CSS",
          "Implementer les Tests d'integration Cypress sur 3 pages, 10 composents differents",
          "Debogage continue de l'application",
          "Factorisation de certaines fonctionnalités prealablement implémenté",
          "Implémenter un graphique Primevue representant les connexions et deconnexions des utilisateurs sur des periodes données de chaques evennements, telechargeable",
          "Intégration d'une Map Leaflet afin de visualiser les differents point de connexions autour du monde, telechargeable",
          "CRUD côté admin pour gerer les nouveaux/actuels utilisateurs"
        ],
        "project": [
          "Bitbucket",
          "Jira",
          "Microsoft Teams"
        ],
        "query": [
          "GraphQL"
        ],
        "javascript": [
          "Utilisation de Visual Studio Code",
          "Utilisation de NodeJS/VueJS",
          "Développement en Typescript Front et Back",
          "Requete via GraphQL",
          "Utilisation de Jitsi pour la partie vidéoconférence"
        ],
        "aws": [
          "Amplify",
          "DynamoDB",
          "Cognito",
          "CloudWatch",
          "AppSync",
          "S3",
          "Route53"
        ]
      }
    ]

}